In [ ]:
import pandas as pd

In [10]:
dic_data = {
    "ahsan" : "SE",
    "warda" : "DR",
    "hamna" : "DR",
    "aamna" : "MB",
    "husnain" : "SE"
}

In [4]:
dic_data

{'ahsan': 'SE', 'warda': 'DR', 'hamna': 'DR', 'aamna': 'MB', 'husnain': 'SE'}

In [6]:
series_data = pd.Series(dic_data)

In [8]:
series_data

ahsan      SE
warda      DR
hamna      DR
aamna      MB
husnain    SE
dtype: object

In [9]:
series_data.dtype

dtype('O')

In [13]:
school_data = {
    "department" : ["computer science", "humanities", "electrical", "data science"],
    "students" : ["ahsan mehmood", "irfan kharal", "shazib qaiser", "shafiqa iqbal"],
    "institute" : ["FAST", "FAST", "NYU", "GOOGLE"]
}

In [14]:
school_data

{'department': ['computer science',
  'humanities',
  'electrical',
  'data science'],
 'students': ['ahsan mehmood',
  'irfan kharal',
  'shazib qaiser',
  'shafiqa iqbal'],
 'institute': ['FAST', 'FAST', 'NYU', 'GOOGLE']}

In [16]:
school_data["department"]

['computer science', 'humanities', 'electrical', 'data science']

In [18]:
df_db = pd.DataFrame(school_data)

In [19]:
df_db

         department       students institute
0  computer science  ahsan mehmood      FAST
1        humanities   irfan kharal      FAST
2        electrical  shazib qaiser       NYU
3      data science  shafiqa iqbal    GOOGLE

In [23]:
df_db["department"]

0    computer science
1          humanities
2          electrical
3        data science
Name: department, dtype: object

In [24]:
df_db

         department       students institute
0  computer science  ahsan mehmood      FAST
1        humanities   irfan kharal      FAST
2        electrical  shazib qaiser       NYU
3      data science  shafiqa iqbal    GOOGLE

In [31]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [30]:
import numpy as np

In [32]:
s

a    1.353875
b    1.550099
c    0.101563
d    0.790774
e   -0.574295
dtype: float64

In [33]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [34]:
s.index[0]

'a'

In [40]:
s1 = pd.Series(np.random.rand(5), name="murder_weights")
s2 = pd.Series(np.random.rand(5), name="survive_weights")

In [41]:
s1 == s2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [42]:
s1

0    0.498403
1    0.529257
2    0.205230
3    0.530175
4    0.471816
Name: murder_weights, dtype: float64

In [43]:
s2

0    0.629146
1    0.352415
2    0.637527
3    0.410046
4    0.693474
Name: survive_weights, dtype: float64

In [46]:
add = s1 + s2

In [47]:
add

0    1.127549
1    0.881671
2    0.842757
3    0.940220
4    1.165290
dtype: float64

In [54]:
df = pd.DataFrame([s1, s2], axis=1)

TypeError: DataFrame.__init__() got an unexpected keyword argument 'axis'

In [55]:
df = pd.concat([s1, s2], axis=1)

In [56]:
df

   murder_weights  survive_weights
0        0.498403         0.629146
1        0.529257         0.352415
2        0.205230         0.637527
3        0.530175         0.410046
4        0.471816         0.693474

In [57]:
df = pd.concat([s1, s2], axis=0)

In [58]:
df

0    0.498403
1    0.529257
2    0.205230
3    0.530175
4    0.471816
0    0.629146
1    0.352415
2    0.637527
3    0.410046
4    0.693474
dtype: float64

In [59]:
s1

0    0.498403
1    0.529257
2    0.205230
3    0.530175
4    0.471816
Name: murder_weights, dtype: float64

In [60]:
s2

0    0.629146
1    0.352415
2    0.637527
3    0.410046
4    0.693474
Name: survive_weights, dtype: float64

In [61]:
type(s2)

pandas.core.series.Series

In [64]:
df = pd.concat([s1, s2], axis=0, ignore_index=True) #ignores the index after merging

In [65]:
df

0    0.498403
1    0.529257
2    0.205230
3    0.530175
4    0.471816
5    0.629146
6    0.352415
7    0.637527
8    0.410046
9    0.693474
dtype: float64

In [87]:
df1_dic = {
    "A" : [1, 3, 66, 33, 2],
    "B" : [2, 44, 2, 45, 11],
}
df1 = pd.Series(df1_dic["A"], name="ahsan")
df2 = pd.Series(df1_dic["B"], name="warda")

In [88]:
df1

0     1
1     3
2    66
3    33
4     2
Name: ahsan, dtype: int64

In [91]:
new_df = pd.concat([df1, df2], axis = 1)

In [92]:
new_df

   ahsan  warda
0      1      2
1      3     44
2     66      2
3     33     45
4      2     11

In [94]:
new_df["ahsan"]

0     1
1     3
2    66
3    33
4     2
Name: ahsan, dtype: int64

In [95]:
df1 = pd.DataFrame({"A": [1, 2], "B": [3, 4]})
df2 = pd.DataFrame({"A": [5, 6], "C": [7, 8]})

In [96]:
df1

   A  B
0  1  3
1  2  4

In [97]:
df2

   A  C
0  5  7
1  6  8

In [98]:
result = pd.concat([df1, df2], axis=1)

In [99]:
result

   A  B  A  C
0  1  3  5  7
1  2  4  6  8

In [102]:
result = pd.concat([df1, df2], axis=0, join="outer")

In [103]:
result

   A    B    C
0  1  3.0  NaN
1  2  4.0  NaN
0  5  NaN  7.0
1  6  NaN  8.0

In [104]:
result = pd.concat([df1, df2], axis=0, join="inner")

In [105]:
result

   A
0  1
1  2
0  5
1  6

In [111]:
s = pd.Series([1, 2, 3], index=[0, 1, 2])  

df = pd.DataFrame({"A": [10, 20], "B": [30, 40], "C": [50, 60]})

In [112]:
df_new = df.add(s, axis=0) #broadcasting along the rows with matching indeces 0 1 2

In [113]:
df_new

      A     B     C
0  11.0  31.0  51.0
1  22.0  42.0  62.0
2   NaN   NaN   NaN

In [114]:
df_new = df.add(s, axis=1)

In [115]:
df_new

    A   B   C   0   1   2
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN